#字典

d = {'QQ':['甲','乙','丙'],123:['A','B','C'],'家':10000}

a = d['QQ'] #取出字典d中的'QQ'键的值,并把这个值赋值给变量a,a被赋值为列表['甲','乙','丙']
b = a[0] #取出列表a中的第0个索引,也就是'甲',并把这个值赋值给变量b
print(b) #打印变量b

print(d[123][1]) #从嵌套中提取元素,d[123]提取出['A','B','C'],d[123][1]提取出'B'

d['家'] = 900 #改变字典中的值
print(d['家'])

d[3.1415926] = '圆周率' #给字典新增键和值
print(d)

print(list(d.values())) #遍历字典中所有的值,可以使用list()来转换为列表

# items()函数以列表返回可遍历的(键,值)元组数组
print(d.items())
for key,value in d.items():
    print('key: {} value: {}'.format(key,value))
